Examinator/src/Catalogs/ШаблоныСообщенийСУО/ШаблоныСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСообщенийСУО</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Действующий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновСообщенийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтоматическойРассылки</name>
    <type>
      <types>EnumRef.ТипыАвтоматическихРассылокСУО</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Переменные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПеременныеШаблоновСообщенийСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПеременные</name>
    <attributes>
      <name>Переменная</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПеременной</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Enums/ТипыШаблоновСообщенийСУО/ТипыШаблоновСообщенийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновСообщенийСУО</name>
  <enumValues>
    <name>АвтоматическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>РучнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СбросПароля</name>
  </enumValues>
  <enumValues>
    <name>ОбъединениеДубликатовПользователей</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ШаблоныСообщенийСУО/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		ДатаИзменения = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипШаблона = Перечисления.ТипыШаблоновСообщенийСУО.АвтоматическаяРассылка Тогда
		ПроверяемыеРеквизиты.Добавить("ТипАвтоматическойРассылки");
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ФорматированныйДокумент = ОбъектКопирования.ФорматированныйДокумент;
	Действующий = Ложь;
КонецПроцедуры


#КонецОбласти

#КонецЕсли
